INSERT INTO "Покупатель" ("id_покупателя", "ФИО", "Номер_телефона", "Адрес")
VALUES 
('P001', 'Иванов Иван Иванович', '+375291234567', 'г. Москва, ул. Ленина, 10'),
('P002', 'Петрова Анна Сергеевна', '+375297654321', 'г. Санкт-Петербург, пр. Невский, 45'),
('P003', 'Сидоров Алексей Павлович', '+375291239876', 'г. Казань, ул. Баумана, 25'),
('P004', 'Кузнецов Михаил Дмитриевич', '+375291230000', 'г. Самара, ул. Победы, 8'),
('P005', 'Васильева Ольга Андреевна', '+375291235577', 'г. Екатеринбург, ул. Мира, 12');

INSERT INTO "Сотрудник" ("id_сотрудника", "ФИО", "Должность", "Номер_телефона")
VALUES
('E001', 'Смирнов Дмитрий Олегович', 'Менеджер по продажам', '+375290001122'),
('E002', 'Кузнецова Елена Викторовна', 'Логист', '+375291112233'),
('E003', 'Орлов Сергей Николаевич', 'Кладовщик', '+375292223344'),
('E004', 'Морозова Наталья Петровна', 'Кассир', '+375293334455'),
('E005', 'Фёдоров Алексей Витальевич', 'Менеджер по закупкам', '+375294445566');

INSERT INTO "Склад" ("id_склада", "Адрес", "Вместимость", "Номер_склада", "Ответственный_сотрудник")
VALUES
('S001', 'г. Москва, пр-т Мира, 100', 5000, '001', 'E003'),
('S002', 'г. Санкт-Петербург, ул. Садовая, 15', 3000, '002', 'E003'),
('S003', 'г. Казань, ул. Вишневая, 8', 2000, '003', 'E002'),
('S004', 'г. Самара, ул. Заводская, 5', 1500, '004', 'E005'),
('S005', 'г. Екатеринбург, ул. Восточная, 20', 2500, '005', 'E005');

INSERT INTO "Товар" ("id_товара", "id_склада", "Название", "Цена", "Количество_на_складе")
VALUES
('T001', 'S001', 'Ноутбук Lenovo IdeaPad', 65000.00, 20),
('T002', 'S001', 'Смартфон Samsung Galaxy', 45000.00, 35),
('T003', 'S002', 'Наушники Sony WH-1000XM5', 32000.00, 15),
('T004', 'S002', 'Монитор LG 27UL500', 28000.00, 10),
('T005', 'S003', 'Клавиатура Logitech MX Keys', 12000.00, 25),
('T006', 'S004', 'Мышь Razer DeathAdder', 5500.00, 40),
('T007', 'S005', 'Веб-камера Logitech C920', 8700.00, 30);

INSERT INTO "Заказ" ("id_заказа", "id_покупателя", "id_сотрудника", "Дата_заказа", "Статус_заказа", "Способ_оплаты")
VALUES
('Z001', 'P001', 'E001', '2025-10-10', 'В обработке', 'Карта'),
('Z002', 'P002', 'E001', '2025-10-11', 'Новый', 'Онлайн'),
('Z003', 'P003', 'E002', '2025-10-12', 'Доставлен', 'Наличные'),
('Z004', 'P004', 'E004', '2025-10-13', 'В обработке', 'Карта'),
('Z005', 'P005', 'E005', '2025-10-14', 'Новый', 'Онлайн');


INSERT INTO "Заказ_Товар" ("id_заказа", "id_товара", "Количество")
VALUES
('Z001', 'T001', 1),
('Z001', 'T002', 2),
('Z002', 'T003', 1),
('Z003', 'T004', 1),
('Z004', 'T005', 3),
('Z005', 'T006', 2),
('Z005', 'T007', 1);

INSERT INTO "Доставка" ("id_доставки", "id_заказа", "Дата_доставки", "Статус_доставки", "Способ_доставки")
VALUES
('D001', 'Z001', '2025-10-13', 'В пути', 'Курьер'),
('D002', 'Z002', '2025-10-14', 'В пути', 'Почта'),
('D003', 'Z003', '2025-10-12', 'Доставлено', 'Самовывоз'),
('D004', 'Z004', '2025-10-15', 'В пути', 'Курьер'),
('D005', 'Z005', '2025-10-16', 'Отменено', 'Почта');



