//1
SELECT "id_покупателя", "ФИО", "Номер_телефона"
FROM "Покупатель"
ORDER BY "ФИО";


//2
SELECT "id_товара", "Название", "Цена"
FROM "Товар"
WHERE "Цена" > 20000
ORDER BY "Цена" DESC;


//3
SELECT "id_заказа", "Дата_заказа", "Статус_заказа"
FROM "Заказ"
WHERE "Статус_заказа" = 'В обработке';


//4
SELECT Z."id_заказа", P."ФИО", Z."Дата_заказа"
FROM "Заказ" Z
JOIN "Покупатель" P ON P."id_покупателя" = Z."id_покупателя"
ORDER BY Z."Дата_заказа";


//5
SELECT T."Название", S."Адрес"
FROM "Товар" T
LEFT JOIN "Склад" S ON T."id_склада" = S."id_склада";


//6
SELECT Z."id_заказа", S."ФИО" AS сотрудник, Z."Статус_заказа"
FROM "Заказ" Z
JOIN "Сотрудник" S ON S."id_сотрудника" = Z."id_сотрудника";


//7
SELECT ZT."id_заказа", T."Название", ZT."Количество"
FROM "Заказ_Товар" ZT
JOIN "Товар" T ON T."id_товара" = ZT."id_товара";


//8
SELECT "id_доставки", "Дата_доставки"
FROM "Доставка"
WHERE "Дата_доставки" > '2025-10-14';


//9
SELECT "ФИО", "Номер_телефона"
FROM "Сотрудник"
WHERE "Номер_телефона" LIKE '+37529%';


//10
SELECT UPPER("ФИО") AS "ФИО_ВерхнийРегистр"
FROM "Покупатель";


//11
SELECT "ФИО", LENGTH("Адрес") AS "Длина_адреса"
FROM "Покупатель";


//12
SELECT CONCAT("Название", ' — ', "Цена") AS "Информация"
FROM "Товар";


//13
SELECT Z."id_заказа", D."Дата_доставки", D."Статус_доставки"
FROM "Заказ" Z
JOIN "Доставка" D ON Z."id_заказа" = D."id_заказа";


//14
SELECT S."Номер_склада", S."Адрес", E."ФИО" AS "Сотрудник"
FROM "Склад" S
LEFT JOIN "Сотрудник" E ON E."id_сотрудника" = S."Ответственный_сотрудник";


//15
SELECT Z."id_заказа", T."Название", ZT."Количество"
FROM "Заказ" Z
JOIN "Заказ_Товар" ZT ON Z."id_заказа" = ZT."id_заказа"
JOIN "Товар" T ON T."id_товара" = ZT."id_товара"
WHERE Z."Способ_оплаты" = 'Карта';
